[Killed] ObjectLiteral
Trybe_projeto-17-reactTestLibrary/sd-06-project-react-testing-library/src/data.js:2:3
 const pokemons = [
-  {
-    id: 25,
-    name: 'Pikachu',
-    type: 'Electric',
-    averageWeight: {
-      value: '6.0',
-      measurementUnit: 'kg',
-    },
-    image: 'https://cdn.bulbagarden.net/upload/b/b2/Spr_5b_025_m.png',
-    moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Pikachu_(Pok%C3%A9mon)',
-    foundAt: [
-      {
-        location: 'Kanto Viridian Forest',
-        map: 'https://cdn.bulbagarden.net/upload/0/08/Kanto_Route_2_Map.png',
-      },
-      {
-        location: 'Kanto Power Plant',
-        map: 'https://cdn.bulbagarden.net/upload/b/bd/Kanto_Celadon_City_Map.png',
-      },
-    ],
-    summary: 'This intelligent Pokémon roasts hard berries with electricity to make them tender enough to eat.',
-  },
+  {},
   {
     id: 4,

[Survived] StringLiteral
Trybe_projeto-17-reactTestLibrary/sd-06-project-react-testing-library/src/data.js:4:11
 const pokemons = [
   {
     id: 25,
-    name: 'Pikachu',
+    name: "",
     type: 'Electric',
     averageWeight: {

[Survived] StringLiteral
Trybe_projeto-17-reactTestLibrary/sd-06-project-react-testing-library/src/data.js:7:14
     name: 'Pikachu',
     type: 'Electric',
     averageWeight: {
-      value: '6.0',
+      value: "",
       measurementUnit: 'kg',
     },

[Survived] StringLiteral
Trybe_projeto-17-reactTestLibrary/sd-06-project-react-testing-library/src/data.js:41:14
       },
       {
         location: 'Kanto Route 3',
-        map: 'https://cdn.bulbagarden.net/upload/4/4a/Kanto_Route_3_Map.png',
+        map: "",
       },
       {

[Survived] StringLiteral
Trybe_projeto-17-reactTestLibrary/sd-06-project-react-testing-library/src/data.js:62:12
       value: '2.9',
       measurementUnit: 'kg',
     },
-    image: 'https://cdn.bulbagarden.net/upload/8/83/Spr_5b_010.png',
+    image: "",
     moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Caterpie_(Pok%C3%A9mon)',
     foundAt: [

[Survived] ObjectLiteral
Trybe_projeto-17-reactTestLibrary/sd-06-project-react-testing-library/src/data.js:73:7
         location: 'Johto Route 31',
         map: 'https://cdn.bulbagarden.net/upload/2/2b/Johto_Route_31_Map.png',
       },
-      {
-        location: 'Ilex Forest',
-        map: 'https://cdn.bulbagarden.net/upload/a/ae/Johto_Ilex_Forest_Map.png',
-      },
+      {},
       {
         location: 'Johto National Park',

[Survived] StringLiteral
Trybe_projeto-17-reactTestLibrary/sd-06-project-react-testing-library/src/data.js:75:14
       },
       {
         location: 'Ilex Forest',
-        map: 'https://cdn.bulbagarden.net/upload/a/ae/Johto_Ilex_Forest_Map.png',
+        map: "",
       },
       {

[Survived] StringLiteral
Trybe_projeto-17-reactTestLibrary/sd-06-project-react-testing-library/src/data.js:78:19
         map: 'https://cdn.bulbagarden.net/upload/a/ae/Johto_Ilex_Forest_Map.png',
       },
       {
-        location: 'Johto National Park',
+        location: "",
         map: 'https://cdn.bulbagarden.net/upload/4/4e/Johto_National_Park_Map.png',
       },

[Survived] StringLiteral
Trybe_projeto-17-reactTestLibrary/sd-06-project-react-testing-library/src/data.js:79:14
       },
       {
         location: 'Johto National Park',
-        map: 'https://cdn.bulbagarden.net/upload/4/4e/Johto_National_Park_Map.png',
+        map: "",
       },
     ],

[Timeout] StringLiteral
Trybe_projeto-17-reactTestLibrary/sd-06-project-react-testing-library/src/data.js:89:14
     name: 'Ekans',
     type: 'Poison',
     averageWeight: {
-      value: '6.9',
+      value: "",
       measurementUnit: 'kg',
     },

[Survived] StringLiteral
Trybe_projeto-17-reactTestLibrary/sd-06-project-react-testing-library/src/data.js:100:14
         map: 'https://cdn.bulbagarden.net/upload/e/ec/Johto_Goldenrod_City_Map.png',
       },
     ],
-    summary: 'It can freely detach its jaw to swallow large prey whole. It can become too heavy to move, however.',
+    summary: "",
   },
   {

[Survived] StringLiteral
Trybe_projeto-17-reactTestLibrary/sd-06-project-react-testing-library/src/data.js:114:19
     moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Alakazam_(Pok%C3%A9mon)',
     foundAt: [
       {
-        location: 'Unova Accumula Town',
+        location: "",
         map: 'https://cdn.bulbagarden.net/upload/4/44/Unova_Accumula_Town_Map.png',
       },

[Survived] ObjectLiteral
Trybe_projeto-17-reactTestLibrary/sd-06-project-react-testing-library/src/data.js:124:20
     id: 151,
     name: 'Mew',
     type: 'Psychic',
-    averageWeight: {
-      value: '4.0',
-      measurementUnit: 'kg',
-    },
+    averageWeight: {},
     image: 'https://cdn.bulbagarden.net/upload/4/43/Spr_5b_151.png',
     moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Mew_(Pok%C3%A9mon)',

[Survived] StringLiteral
Trybe_projeto-17-reactTestLibrary/sd-06-project-react-testing-library/src/data.js:125:14
     name: 'Mew',
     type: 'Psychic',
     averageWeight: {
-      value: '4.0',
+      value: "",
       measurementUnit: 'kg',
     },

[Survived] StringLiteral
Trybe_projeto-17-reactTestLibrary/sd-06-project-react-testing-library/src/data.js:133:14
     foundAt: [
       {
         location: 'Faraway Island',
-        map: 'https://cdn.bulbagarden.net/upload/e/e4/Hoenn_Faraway_Island_Map.png',
+        map: "",
       },
     ],

[Survived] ObjectLiteral
Trybe_projeto-17-reactTestLibrary/sd-06-project-react-testing-library/src/data.js:138:3
     ],
     summary: 'Apparently, it appears only to those people who are pure of heart and have a strong desire to see it.',
   },
-  {
-    id: 78,
-    name: 'Rapidash',
-    type: 'Fire',
-    averageWeight: {
-      value: '95.0',
-      measurementUnit: 'kg',
-    },
-    image: 'https://cdn.bulbagarden.net/upload/5/58/Spr_5b_078.png',
-    moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Rapidash_(Pok%C3%A9mon)',
-    foundAt: [
-      {
-        location: 'Kanto Route 28',
-        map: 'https://cdn.bulbagarden.net/upload/5/5b/Kanto_Route_28_Map.png',
-      },
-      {
-        location: 'Johto Mount Silver',
-        map: 'https://cdn.bulbagarden.net/upload/9/95/Johto_Mt_Silver_Map.png',
-      },
-    ],
-    summary: 'At full gallop, its four hooves barely touch the ground because it moves so incredibly fast.',
-  },
+  {},
   {
     id: 143,

[Survived] ObjectLiteral
Trybe_projeto-17-reactTestLibrary/sd-06-project-react-testing-library/src/data.js:164:20
     id: 143,
     name: 'Snorlax',
     type: 'Normal',
-    averageWeight: {
-      value: '460.0',
-      measurementUnit: 'kg',
-    },
+    averageWeight: {},
     image: 'https://cdn.bulbagarden.net/upload/4/40/Spr_5b_143.png',
     moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Snorlax_(Pok%C3%A9mon)',

[Survived] StringLiteral
Trybe_projeto-17-reactTestLibrary/sd-06-project-react-testing-library/src/data.js:180:11
   },
   {
     id: 148,
-    name: 'Dragonair',
+    name: "",
     type: 'Dragon',
     averageWeight: {

[Survived] ObjectLiteral
Trybe_projeto-17-reactTestLibrary/sd-06-project-react-testing-library/src/data.js:189:7
     image: 'https://cdn.bulbagarden.net/upload/2/2c/Spr_5b_148.png',
     moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Dragonair_(Pok%C3%A9mon)',
     foundAt: [
-      {
-        location: 'Johto Route 45',
-        map: 'https://cdn.bulbagarden.net/upload/2/21/Johto_Route_45_Map.png',
-      },
+      {},
       {
         location: 'Johto Dragon\'s Den',
