[Survived] ConditionalExpression
Trybe_projeto-17-reactTestLibrary/sd-06-project-react-testing-library/src/serviceWorker.js:14:3
 // opt-in, read https://bit.ly/CRA-PWA
 
 const isLocalhost = Boolean(
-  window.location.hostname === 'localhost' ||
-    // [::1] is the IPv6 localhost address.
-    window.location.hostname === '[::1]' ||
-    // 127.0.0.0/8 are considered localhost for IPv4.
-    window.location.hostname.match(
-      /^127(?:\.(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}$/
-    )
+  false
 );
 

[Survived] ConditionalExpression
Trybe_projeto-17-reactTestLibrary/sd-06-project-react-testing-library/src/serviceWorker.js:78:19
               );
 
               // Execute callback
-              if (config && config.onUpdate) {
+              if (false) {
                 config.onUpdate(registration);
               }

[Survived] StringLiteral
Trybe_projeto-17-reactTestLibrary/sd-06-project-react-testing-library/src/serviceWorker.js:104:16
 function checkValidServiceWorker(swUrl, config) {
   // Check if the service worker can be found. If it can't reload the page.
   fetch(swUrl, {
-    headers: { 'Service-Worker': 'script' }
+    headers: { "": 'script' }
   })
     .then(response => {

[Survived] EqualityOperator
Trybe_projeto-17-reactTestLibrary/sd-06-project-react-testing-library/src/serviceWorker.js:111:33
       const contentType = response.headers.get('content-type');
       if (
         response.status === 404 ||
-        (contentType != null && contentType.indexOf('javascript') === -1)
+        (contentType != null && contentType.indexOf('javascript') !== -1)
       ) {
         // No service worker found. Probably a different app. Reload the page.
